src/DataProcessors/КолесоЖизни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>КолесоЖизни</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/План.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>План</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценкаЧЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИПроекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РезультатПоПлану.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>РезультатПоПлану</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатПоПлану</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактЧЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИПроекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/КолесоЖизни/Ext/ObjectModule.bsl
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Функция ПолучитьТаблицуЗадач(Дата)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпрТипыПроектов.ТипПроекта,
		|	СпрТипыПроектов.Дата,
		|	РСПлан.Проект,
		|	РСПлан.ИД,
		|	РСПлан.Пользователь,
		|	РСПлан.План,
		|	РСПлан.ОценкаЧЧ,
		|	РСФакт.РезультатПоПлану,
		|	РСФакт.ФактЧЧ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТипыИПроекты.Ссылка КАК ТипПроекта,
		|		&ВыбраннаяДата КАК Дата
		|	ИЗ
		|		Справочник.ТипыИПроекты КАК ТипыИПроекты
		|	ГДЕ
		|		НЕ ТипыИПроекты.ПометкаУдаления
		|		И ТипыИПроекты.ЭтоГруппа
		|		И ТипыИПроекты.Родитель = &ПустойРодитель) КАК СпрТипыПроектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РСПлан.Проект КАК Проект,
		|			РСПлан.ИД КАК ИД,
		|			РСПлан.Дата КАК Дата,
		|			РСПлан.Пользователь КАК Пользователь,
		|			РСПлан.План КАК План,
		|			РСПлан.ОценкаЧЧ КАК ОценкаЧЧ,
		|			РСПлан.Проект.Родитель КАК ТипПроекта
		|		ИЗ
		|			РегистрСведений.План КАК РСПлан
		|		ГДЕ
		|			РСПлан.Дата = &ВыбраннаяДата) КАК РСПлан
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				РСРезультатПоПлану.Дата КАК Дата,
		|				РСРезультатПоПлану.Проект КАК Проект,
		|				РСРезультатПоПлану.ИД КАК ИД,
		|				РСРезультатПоПлану.РезультатПоПлану КАК РезультатПоПлану,
		|				РСРезультатПоПлану.ФактЧЧ КАК ФактЧЧ,
		|				РСРезультатПоПлану.Проект.Родитель КАК ТипПроекта
		|			ИЗ
		|				РегистрСведений.РезультатПоПлану КАК РСРезультатПоПлану
		|			ГДЕ
		|				РСРезультатПоПлану.Дата = &ВыбраннаяДата) КАК РСФакт
		|			ПО РСПлан.ИД = РСФакт.ИД
		|				И РСПлан.Дата = РСФакт.Дата
		|		ПО СпрТипыПроектов.ТипПроекта = РСПлан.ТипПроекта
		|			И СпрТипыПроектов.Дата = РСПлан.Дата";
	
	Запрос.УстановитьПараметр("ВыбраннаяДата", Дата);
	Запрос.УстановитьПараметр("ПустойРодитель", Справочники.ТипыИПроекты.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;

КонецФункции // ЗаполнитьТаблицуЗадач()
